linux_distros.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux-distros</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<div id="outline-container-org7545191" class="outline-2">
<h2 id="org7545191">Linux distributions</h2>
<div class="outline-text-2" id="text-org7545191">
<p>
Having many flavors makes some lovely hot garbage&#x2026;
</p>
</div>
<div id="outline-container-orgf38316a" class="outline-4">
<h4 id="orgf38316a"><a href="android.html#ID-8005808d-1b21-48df-9706-6b999ee9aff6">android</a></h4>
</div>
<div id="outline-container-orgb5b797b" class="outline-4">
<h4 id="orgb5b797b">ubuntu</h4>
<div class="outline-text-4" id="text-orgb5b797b">
<ul class="org-ul">
<li>debian based</li>
<li>snaps and apt for packages</li>
<li>zfs by default</li>
<li>aws EKS for baremetal
<ul class="org-ul">
<li>preinstalled components
<ul class="org-ul">
<li>metallb for load balancer</li>
<li>Cilium CNI for networking</li>
<li>Flux for gitops</li>
<li>eksctl for control</li>
</ul></li>
<li>same pod and node limit at kubernetes (5000 nodes 110 pods per node 150000 total pods)</li>
<li>build own ova <a href="https://github.com/aws/eks-distro-build-tooling">https://github.com/aws/eks-distro-build-tooling</a></li>
<li>can run locally with containers (based on amazon linux 2)
<ul class="org-ul">
<li>requires docker with cgroupsv1</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org99de81e" class="outline-4">
<h4 id="org99de81e">manjaro</h4>
<div class="outline-text-4" id="text-org99de81e">
<ul class="org-ul">
<li>arch based</li>
<li>pamac and pacman for packages</li>
<li>mkinitcpio for initraramfs</li>
</ul>
</div>
</div>
<div id="outline-container-org6c0d76d" class="outline-4">
<h4 id="org6c0d76d"><a href="openwrt.html#ID-18ebc285-c771-4420-a040-011fd3b96b51">openwrt</a></h4>
</div>
<div id="outline-container-orgcd79ce3" class="outline-4">
<h4 id="orgcd79ce3">RHEL</h4>
<div class="outline-text-4" id="text-orgcd79ce3">
<ul class="org-ul">
<li>dracut for initraramfs</li>
<li>yum/dnf for package managers</li>
<li>fedora uses btrfs</li>
<li>killed centos
<ul class="org-ul">
<li>replaced by rocky/alma</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgebbf96a" class="outline-4">
<h4 id="orgebbf96a">gentoo</h4>
<div class="outline-text-4" id="text-orgebbf96a">
<ul class="org-ul">
<li>portage for packages
<ul class="org-ul">
<li>use flags for config</li>
<li>overlays for external repos</li>
<li>can use binaries but usually source only</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
